# 1 - Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
#
# *Пример:*
#
# - 6782 -> 23
# - 0,56 -> 11

def main():
    print('Hi!')


if __name__ == "__main__":
    main()
